// 기본값: { credits: 3, isMajor: false }
// 기본값과 다른 과목만 등록
const COURSE_CREDITS = {
  // 학점이 다른 과목
  "008740": { credits: 2 },
  "008744": { credits: 2 },
  "007001": { credits: 1 },
  "007002": { credits: 1 },
  "007003": { credits: 1 },
  "007004": { credits: 1 },
  "007005": { credits: 1 },
  "007006": { credits: 1 },
  "007007": { credits: 1 },
  "007008": { credits: 1 },
  "007009": { credits: 1 },

// ==================================================
  // ABEEK 교양
  
  // 기초교양
  "007114": { credits: 2 },                 // 전공기초영어(Ⅰ)
  "007115": { credits: 2 },                 // 전공기초영어(Ⅱ)

  // 일반교양
  "002602": { credits: 2 },                 // 교양일본어(2)
  "002604": { credits: 2 },                 // 교양중국어(2)
  "002608": { credits: 2 },                 // 교양스페인어(2)
  "002598": { credits: 2 },                 // 교양독일어(2)
  "002600": { credits: 2 },                 // 교양프랑스어(2)

  // 핵심교양
  "008753": { credits: 2 },                 // CTO특강

  // MSC과학
  "012103": { credits: 1 },                 // 대학물리실험(1)
  "012109": { credits: 1 },                 // 대학화학실험(1)

// ==================================================
  // 일반교양

  // 사회계열
  "002660": { credits: 1 },                 // 홍익서비스러닝
  "002133": { credits: 2 },                 // 직업과취업
  "002623": { credits: 2 },                 // 직무이해와취업역량개발  
  "002132": { credits: 2 },                 // 자기이해와진로탐색
  "002565": { credits: 2 },                 // 창업과경영

  // 자연계열
  "002677": { credits: 6 },                 // 산학모빌리티프로젝트

  // 예체능계열
  "002052": { credits: 2 },                 // 여가생활과레크레이션
  "002223": { credits: 2 },                 // 농구
  "002695": { credits: 2 },                 // 여자농구
  "994365": { credits: 2 },                 // 안보학
  "994366": { credits: 2 },                 // 조직리더십
  "002798": { credits: 2 },                 // 글로컬디자인창업(1)
  "002800": { credits: 2 },                 // 라이프스타일브랜드창업(1)
  "002805": { credits: 2 },                 // 디자인창업실전
  "002827": { credits: 2 },                 // 글로벌패션전문가실무과정(1)
  "002829": { credits: 2 },                 // CLO 3D패션디자인과정(1)

  // 영어계열
  "002306": { credits: 2 },                 // 영상영어
  "002314": { credits: 2 },                 // 시사영어
  "002388": { credits: 2 },                 // 실용영문법
  "008759": { credits: 2 },                 // 영어회화
  "008761": { credits: 2 },                 // 실용영어
  "008762": { credits: 2 },                 // 고급실용영어

  // 제2외국어계열
  "002300": { credits: 2 },                 // 중국어중급회화(1)
  "002301": { credits: 2 },                 // 중국어토론연습
  "002304": { credits: 2 },                 // 초급일본어(3)
  "002305": { credits: 2 },                 // 초급일본어강독
  "002320": { credits: 2 },                 // 중급일본어(1)
  "002321": { credits: 2 },                 // 중급일본어(2)
  "002324": { credits: 2 },                 // 중급일본어강독
  "002397": { credits: 2 },                 // 초급중국어(3)
  "002398": { credits: 2 },                 // 중급중국어(1)
  "002429": { credits: 2 },                 // 초급일본어회화연습
  "002445": { credits: 2 },                 // 중국어기초회화(1)
  "002446": { credits: 2 },                 // 중국어기초회화(2)
  "002447": { credits: 2 },                 // 중급일본어회화연습
  "002510": { credits: 2 },                 // 중국어로 배우는 한국문화와예술
  "002525": { credits: 2 },                 // 초급중국어 강독(1)
  "002541": { credits: 2 },                 // 고급일본어회화연습
  "002542": { credits: 2 },                 // 영상일본어
  "002562": { credits: 2 },                 // 초급이태리어
  "008742": { credits: 2 },                 // 고급일본어
  "008743": { credits: 2 },                 // 일본어작문

  // 교직
  "002100": { credits: 1 },                 // 현장교육역량실습(A)
  "008725": { credits: 2 },                 // 교육봉사
  "008731": { credits: 2 },                 // 교과논리및논술
  "008302": { credits: 2 },                 // 교육심리
  "008303": { credits: 2 },                 // 교육평가
  "008501": { credits: 2 },                 // 교육행정및교육경영
  "008502": { credits: 2 },                 // 교육사철학
  "008726": { credits: 2 },                 // 학교현장실습
  "008733": { credits: 2 },                 // 학교폭력예방및학생의이해
  "053504": { credits: 1 },                 // 디지털교육
  
// ==================================================
  // 전공(컴공) 과목
  "013312": { credits: 4, isMajor: true },  // 자료구조및프로그래밍
  "013313": { credits: 4, isMajor: true },  // 논리회로설계및실험
  "101307": { isMajor: true },              // 인터넷프로그래밍
  "101408": { isMajor: true },              // 어셈블리언어및실습
  "101410": { isMajor: true },              // 데이터통신
  "101412": { isMajor: true },              // 멀티미디어응용수학
  "101413": { isMajor: true },              // HCI윈도우즈프로그래밍
  "101503": { isMajor: true },              // 알고리즘분석
  "101510": { isMajor: true },              // 컴퓨터구조
  "101511": { isMajor: true },              // 운영체제
  "101512": { isMajor: true },              // 프로그래밍언어론
  "101606": { isMajor: true },              // 오토마타
  "101609": { isMajor: true },              // 컴퓨터네트워크
  "101612": { isMajor: true },              // 비디오이미지프로세싱
  "101613": { credits: 4, isMajor: true },  // 기초데이터베이스
  "101615": { isMajor: true },              // 디지털시스템설계
  "101616": { isMajor: true },              // 문제해결기법
  "101617": { isMajor: true },              // 기계학습기초
  "101708": { isMajor: true },              // 소프트웨어공학
  "101717": { isMajor: true },              // AIML응용프로젝트1
  "101718": { isMajor: true },              // 컴퓨터그래픽스와메타버스
  "101719": { isMajor: true },              // 기계학습심화
  "101720": { isMajor: true },              // 정보보안
  "101721": { isMajor: true },              // 종합설계프로젝트1
  "101811": { isMajor: true },              // 창직종합설계프로젝트1
  "101812": { isMajor: true },              // 창직종합설계프로젝트2
  "101814": { isMajor: true },              // AIML응용프로젝트2
  "101815": { isMajor: true },              // 블록체인
  "101817": { isMajor: true },              // 종합설계프로젝트2
  "101991": { isMajor: true },              // 홍익챌린지(1)
  "101992": { isMajor: true },              // 홍익챌린지(2)
  "101993": { isMajor: true },              // 홍익챌린지(3)

  "777002": { credits: 6, isMajor: true },  // 빅데이터기반경영 / 사업타당성분석
};

export default COURSE_CREDITS;