// 시각디자인학과 전공 필수 및 전공 과목

export const REQ_VD = {
  category: "전공 필수",
  type: "each",
  items: [
    { label: "기초평면(1)", ids: ["400101"] },
    { label: "기초입체(1)", ids: ["400102"] },
    { label: "커뮤니케이션디자인(1)", ids: ["410829"] },
    { label: "커뮤니케이션디자인(2)", ids: ["410831"] },
    { label: "타이포그라피(2)", ids: ["410313"] },
    { label: "한국디자인사(1)", ids: ["410518"] },
    { label: "한국디자인사(2)", ids: ["410618"] },
  ],
}

export const VD_MAJOR_IDS = new Set([
  "043260", // 자유연상과표현기법(2)
  "043261", // 드로잉(2)
  "400101", // 기초평면(1)
  "400102", // 기초입체(1)
  "410113", // 드로잉(1)
  "410114", // 자유연상과표현기법(1)
  "410117", // 사진입문
  "410118", // 기초그래픽디자인
  "410211", // 타이포그라피(1)
  "410313", // 타이포그라피(2)
  "410321", // 스튜디오사진(1)
  "410322", // 일러스트레이션(1)
  "410323", // 3D디자인(1)
  "410324", // 인터렉티브디자인(1)
  "410421", // 스튜디오사진(2) / 일러스트레이션(2)
  "410423", // 인터렉티브디자인(2)
  "410424", // 디자인조형론
  "410425", // 3D디자인(2)
  "410514", // 디자인심리
  "410518", // 한국디자인사(1)
  "410519", // 디지털워크숍(1)
  "410520", // 디자인텍스트(1)
  "410521", // 미래실험실
  "410618", // 한국디자인사(2)
  "410619", // 디지털워크숍(2)
  "410620", // 디자인텍스트(2)
  "410720", // 디지털워크숍(3)
  "410817", // 타이포그라피(3)
  "410818", // 사회문화적디자인스튜디오(1)
  "410819", // 작가적디자인스튜디오(1)
  "410820", // 사회문화적디자인스튜디오(2)
  "410821", // 작가적디자인스튜디오(2)
  "410823", // 디자인리서치(1)
  "410824", // 디자인리서치(2)
  "410829", // 커뮤니케이션디자인(1)
  "410830", // 영상(1)
  "410831", // 커뮤니케이션디자인(2)
  "410832", // 영상(2)
  "410834", // 기업적디자인스튜디오(1)
  "410836", // 기업적디자인스튜디오(2)
  "410839", // 기업적디자인스튜디오(3)
  "410840", // 작가적디자인스튜디오(3)
  "410841", // 사회문화적디자인스튜디오(3)
  "410847", // 포트폴리오제작
  "410850", // 졸업프로젝트
  "410851", // 피지컬워크숍(1)
  "410852", // 피지컬워크숍(2)
  "410853", // 피지컬워크숍(3)
  "410991", // 홍익챌린지(1)
  "410992", // 홍익챌린지(2)
  "410993", // 홍익챌린지(3)
  "777032", // 패션디자인(2)/타이포그라피(3) PBL1+1 융합
])
